<a href="https://colab.research.google.com/github/ylsel88/pydocs/blob/master/Create%20Dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(data={'TXC_YTD_AMT':[1,2,3,4],'RAT':['PV MTM','PV Cost','MCS','UMC']})

def TLE_value(c):
    if c['RAT'] == 'PV Cost':
        return df['TXC_YTD_AMT'].map(str)

df['TLE_value'] = df.apply(TLE_value, axis=1)
df['TLE_value'] = np.where(df['RAT'] == 'PV Cost', df['TXC_YTD_AMT'].map(str),'')
df

   TXC_YTD_AMT      RAT TLE_value
0            1   PV MTM
1            2  PV Cost         2
2            3      MCS
3            4      UMC